;; Added packages
(package! mixed-pitch)
(package! company-posframe)
(package! scroll-on-jump)
(package! with-venv)
(package! polymode)
(package! elegant-agenda-mode)

;; Currently requires manual install
(package! lsp-julia :recipe (:host github :repo "non-jedi/lsp-julia"))

                                        ;: Disabled
(package! solaire-mode :disable t)
